[
    "Discord was publicly launched in May 2015.",
    "Discord was created to solve poor voice chat for gamers.",
    "Founders: Stanislav Vishnevskiy and Jason Citron.",
    "Discord started as a gaming chat but is now a general community platform.",
    "Over 200 million monthly active users as of 2025.",
    "300+ languages supported on Discord.",
    "Servers are Discord’s core community units.",
    "A single server can have up to 500,000 members by default.",
    "Servers can hold up to 500 channels organized into 50 categories.",
    "Bots automate tasks like moderation, music, and games.",
    "Over 12 million active bots exist on Discord.",
    "Bot messages make up ~28% of all server traffic.",
    "Slash commands have been executed over 1.7 billion times monthly.",
    "Discord Nitro unlocks custom emojis usable across all servers.",
    "Nitro increases file upload size to 500 MB.",
    "Nitro allows HD streaming up to 4K at 60fps.",
    "Servers can charge subscriptions with Discord’s server monetization.",
    "Discord earns revenue through Nitro and server subscription fees.",
    "Discord’s valuation is around $15 billion.",
    "Discord has never made a reported annual profit.",
    "Discord highly resisted ads but now tests sponsored content.",
    "Discord cut ~20% of its workforce in 2024 for efficiency.",
    "Discord retains encryption for text, voice, and video.",
    "Bots can reduce admin workload by ~45% on average.",
    "Over 680,000 developers build or maintain Discord bots monthly.",
    "Discord’s unofficial largest server (Midjourney) has millions of members.",
    "Users can join servers by invite link only.",
    "Discord supports direct messages and group DMs.",
    "Voice channels can handle up to hundreds of users simultaneously.",
    "Stage channels allow moderated audio talks.",
    "Threads can auto-archive and disappear.",
    "Discord Nitro Classic existed before modern Nitro tiers.",
    "Emoji use without Nitro is limited to original server scope.",
    "Rich Presence shows in-game status on Discord profiles.",
    "Discord started as a Hammer & Chisel game company project.",
    "Discord’s official birthday is May 13, 2015.",
    "Discord was almost named Wyvern or Bonfire prior to launch.",
    "Discord’s logo is named Clyde.",
    "Wumpus is Discord’s official mascot.",
    "Wumpus characters appear across the app and branding.",
    "Discord’s original client was browser-only before apps.",
    "Server boost perks include better audio and animated icons.",
    "Users with Nitro get free boost discounts.",
    "Two-factor authentication is available for security.",
    "AutoMod blocks millions of undesired messages automatically.",
    "Discord tracks user IP locations for connection routing.",
    "Discord privacy lets you filter DMs by friend status.",
    "Servers can have custom rules and channel permissions.",
    "Admins can assign custom roles to members.",
    "Servers use categories to organize channels.",
    "Slash commands standardize bot interactions.",
    "Discord introduced an App Launcher in 2024.",
    "Clyde also exists as a built-in bot responding to slash commands.",
    "Discord once launched a games storefront.",
    "Microsoft once offered to buy Discord for a large sum.",
    "Discord refused acquisition to stay independent.",
    "Mobile and desktop experiences differ slightly UI-wise.",
    "Discord supports screen sharing without external software.",
    "Discord’s voice calls are VoIP based.",
    "You can stream gameplay to server members directly.",
    "Discord can integrate with PlayStation accounts.",
    "Bots can welcome new users automatically.",
    "Bots can run polls and activity trackers.",
    "Discord voice chats can replace conference tools.",
    "Servers can be public or private by invite only.",
    "Discord supports rich text formatting (markdown).",
    "You can mute channels or entire servers.",
    "Streamer Mode hides sensitive info while broadcasting.",
    "Role order can dictate visual name colors.",
    "Private servers can host large global communities.",
    "Data breaches via third-party support occurred in 2025.",
    "Age verification requirements vary by country.",
    "Discord’s Trust & Safety team operates globally.",
    "Discord’s Hateful Conduct Policy bans misgendering and deadnaming.",
    "Discord communities fuel youth coordination & activism globally.",
    "Discord helped publish leaked classified documents in 2023.",
    "Reddit and Discord communities often intersect in culture.",
    "Some servers host listening parties for artists.",
    "Discord’s API lets developers create custom integrations.",
    "Users can join server discovery to find interest communities.",
    "Discord’s UI gets frequent updates that may disrupt navigation.",
    "Mobile app stability is a common user complaint.",
    "Older Easter Eggs existed like /tableflip commands.",
    "Group DMs can include up to 10 participants.",
    "Discord features persistent chat logs (text history).",
    "Discord supports file sharing up to user limit.",
    "Voice channels record no call history by default.",
    "Discord supports pinned messages per channel.",
    "Verified servers once numbered ~450 at launch.",
    "Discord allows custom status messages.",
    "Server directories show trending communities.",
    "Some countries have blocked Discord over content issues.",
    "Nitro sometimes includes animated profile badges.",
    "Discord bots populate a marketplace of thousands.",
    "Auto-generated server invite codes rotate for security.",
    "Discord supports text-to-speech messaging (optional).",
    "Bots can auto-moderate spam and flagged words.",
    "Server owners can set link-only verification gates.",
    "Discord data analytics tools help manage growth.",
    "Discord continues evolving beyond gaming roots."
]